request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
		 xmlns:tns="http://localhost:8080/ws/">
   <soapenv:Header/>
   <soapenv:Body>
      <tns:getTrainRequest>
         <tns:id>1</tns:id>
      </tns:getTrainRequest>
   </soapenv:Body>
</soapenv:Envelope>
